tests/erosionEquilibrium1D_tilted/0_org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    
    outlet
    {
        type             cyclic;
    }

    top
    {
        type             fixedValue;
        value            uniform (0 0 0);
    }
    
    bed
    {
        type             fixedValue;
        value            uniform (0 0 0);
    }

    frontAndBackPlanes
    {
        type             empty;
    }
}


// ************************************************************************* //
